BabbleSim/ext_NRF52_hw_models/src/HW_models/NHW_RADIO.c
static double cheat_rx_power_offset;

static void start_Tx(void);
static void start_Tx_FEC2(void);
static void start_Rx(void);
static void start_Rx_FEC2(void);
static void start_CCA_ED(bool CCA_not_ED);
static void Rx_Addr_received(void);
static void Tx_abort_eval_respond(void);
static void Rx_abort_eval_respond(void);
#if 0 //Note6.b
static p2G4_rssi_power_t Rx_abort_imm_RSSI(void);
#endif
static void CCA_abort_eval_respond(void);
static void nhw_radio_device_address_match(uint8_t rx_buf[]);

static void radio_set_registers_defaults(void) {
  //Registers' reset values:
  NRF_RADIO_regs.FREQUENCY = 0x00000002;
  NRF_RADIO_regs.SFD = 0xA7;
  NRF_RADIO_regs.CCACTRL = 0x052D0000;
  NRF_RADIO_regs.CTEINLINECONF = 0x00002800;
  NRF_RADIO_regs.DFECTRL1 = 0x00023282;
  for (int i = 0; i < 8; i++)
    NRF_RADIO_regs.PSEL.DFEGPIO[i] = 0xFFFFFFFF;
  NRF_RADIO_regs.DFEPACKET.MAXCNT = 0x00001000;

#if defined(NRF54L15) && !defined(RADIO_DATAWHITEIV_DATAWHITEIV_Msk)
  NRF_RADIO_regs.DATAWHITE = 0x00890040;
#else
  NRF_RADIO_regs.DATAWHITEIV = 0x00000040;
#endif

#if !NHW_RADIO_IS_54
  NRF_RADIO_regs.MODECNF0 = 0x00000200;
  NRF_RADIO_regs.POWER = 1;
#else
  NRF_RADIO_regs.EDCTRL = 0x20000000;
  NRF_RADIO_regs.TXPOWER = 0x00000013;
#endif
}

static void radio_reset(void) {
  memset(&NRF_RADIO_regs, 0, sizeof(NRF_RADIO_regs));
  radio_state = RAD_DISABLED;
  radio_sub_state = SUB_STATE_INVALID;
  Timer_RADIO = TIME_NEVER;

  TIFS_state = TIFS_DISABLE;
  TIFS_ToTxNotRx = false;
  Timer_TIFS = TIME_NEVER;

  radio_set_registers_defaults();

  nhwra_signalif_reset();
}

static void nhw_radio_init(void) {
  nrfra_timings_init();
  radio_reset();
#if !NHW_RADIO_IS_54
  radio_POWER = false;
#endif
  bits_per_us = 1;
}

NSI_TASK(nhw_radio_init, HW_INIT, 100);

double nhw_radio_get_bpus(void) {
  return bits_per_us;
}

static inline void nhwra_set_Timer_RADIO(bs_time_t t){
  Timer_RADIO = t;
  nsi_hws_find_next_event();
}

static inline void nhwra_set_Timer_abort_reeval(bs_time_t t){
  Timer_RADIO_abort_reeval = t;
  nsi_hws_find_next_event();
}

void nhw_RADIO_TASK_TXEN(void) {
  if ( ( radio_state != RAD_DISABLED )
      && ( radio_state != RAD_TXIDLE )
      && ( radio_state != RAD_RXIDLE ) ){
    bs_trace_warning_line_time(
        "NRF_RADIO: TXEN received when the radio was not DISABLED or TX/RXIDLE but in state %i. It will be ignored. Expect problems\n",
        radio_state);
    return;
  }
  radio_state = RAD_TXRU;
  NRF_RADIO_regs.STATE = RAD_TXRU;

  nhwra_set_Timer_RADIO(nsi_hws_get_time() + nhwra_timings_get_rampup_time(1, from_hw_tifs));
}

void nhw_RADIO_TASK_RXEN(void) {
  if ( ( radio_state != RAD_DISABLED )
      && ( radio_state != RAD_TXIDLE )
      && ( radio_state != RAD_RXIDLE ) ){
    bs_trace_warning_line_time(
        "NRF_RADIO: RXEN received when the radio was not DISABLED or TX/RXIDLE but in state %i. It will be ignored. Expect problems\n",
        radio_state);
    return;
  }
  TIFS_state = TIFS_DISABLE;
  radio_state = RAD_RXRU;
  NRF_RADIO_regs.STATE = RAD_RXRU;
  nhwra_set_Timer_RADIO(nsi_hws_get_time() + nhwra_timings_get_rampup_time(0, from_hw_tifs));
}

static void abort_if_needed(void) {
  if ( ( abort_fsm_state == Tx_Abort_reeval )
      || ( abort_fsm_state == Rx_Abort_reeval )
      || ( abort_fsm_state == CCA_Abort_reeval ) ){
    //If the phy is waiting for a response from us, we need to tell it, that we are aborting whatever it was doing
    aborting_set = 1;
  }
  /* Note: In Rx, we may be
   *   waiting to respond to the Phy to an abort reevaluation request abort_fsm_state == Rx_Abort_reeval
   *   or waiting to reach the address end time to respond to the Phy if we accepted the packet or not
   * but not both
   */
  if ( radio_sub_state == RX_WAIT_FOR_ADDRESS_END ){
    //we answer immediately to the phy rejecting the packet
    p2G4_dev_rxv2_cont_after_addr_nc_b(false, NULL);
    radio_sub_state = SUB_STATE_INVALID;
  }
}

void nhw_RADIO_TASK_START(void) {
  if ( radio_state == RAD_TXIDLE ) {
    bs_time_t Tx_start_time = nsi_hws_get_time() + nhwra_timings_get_TX_chain_delay();
    radio_state = RAD_TXSTARTING;
    NRF_RADIO_regs.STATE = RAD_TX;
    nhwra_set_Timer_RADIO(Tx_start_time);
  } else if ( radio_state == RAD_RXIDLE ) {
    start_Rx();
  } else {
    bs_trace_warning_line_time(
        "NRF_RADIO: TASK_START received while the radio was not in either TXIDLE or RXIDLE but in state %i. It will be ignored => expect problems\n",
        radio_state);
  }
}

void nhw_RADIO_TASK_SOFTRESET(void) {
  if (radio_state != RAD_DISABLED) {
    bs_trace_warning_line_time(
        "NRF_RADIO: TASK_SOFTRESET should only be used in disabled state."
        "Current state %i\n", radio_state);
  }

#if defined(RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Msk)
  //Reset all registers after interrupts (first is MODE), but not the PACKETPTR.
  //Note: DFE PACKETPTR should also not be reset(?), but is not yet implemented
  memset((void *)&NRF_RADIO_regs.MODE, 0, offsetof(NRF_RADIO_Type, PACKETPTR) - offsetof(NRF_RADIO_Type, MODE));
  memset((void *)&NRF_RADIO_regs.CSTONES, 0, sizeof(NRF_RADIO_Type) - offsetof(NRF_RADIO_Type, CSTONES));
  radio_set_registers_defaults();
#endif
}

void nhw_RADIO_TASK_CCASTART(void) {
  if ((radio_state != RAD_RXIDLE)){
    bs_trace_warning_line_time(
        "NRF_RADIO: CCASTART received when the radio was not RXIDLE but in state %i. "
        "It will be ignored. Expect problems\n",
        radio_state);
    return;
  }
  start_CCA_ED(1);
}

void nhw_RADIO_TASK_CCASTOP(void) {
  if (( radio_state == RAD_CCA_ED ) && ( cca_status.CCA_notED )) {
    abort_if_needed();
    radio_state = RAD_RXIDLE;
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    nhw_RADIO_signal_EVENTS_CCASTOPPED(0);
  } else {
    bs_trace_info_line_time(3,
        "NRF_RADIO: TASK_CCASTOP received while the radio was not on a CCA procedure (was %i, %i). "
        "It will be ignored\n",
        radio_state, cca_status.CCA_notED);
  }
}

void nhw_RADIO_TASK_EDSTART(void) {
  if ((radio_state != RAD_RXIDLE)){
    bs_trace_warning_line_time(
        "NRF_RADIO: EDSTART received when the radio was not RXIDLE but in state %i. "
        "It will be ignored. Expect problems\n",
        radio_state);
    return;
  }
  start_CCA_ED(0);
}

