BabbleSim/ext_NRF52_hw_models/src/HW_models/NHW_RADIO.c
void nhw_RADIO_TASK_EDSTOP(void) {
  if (( radio_state == RAD_CCA_ED ) && ( cca_status.CCA_notED == 0)) {
    abort_if_needed();
    radio_state = RAD_RXIDLE;
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    nhw_RADIO_signal_EVENTS_EDSTOPPED(0);
  } else {
    bs_trace_info_line_time(3,
        "NRF_RADIO: TASK_EDSTOP received while the radio was not on a ED procedure (was %i, %i). "
        "It will be ignored\n",
        radio_state, cca_status.CCA_notED);
  }
}

void nhw_RADIO_TASK_STOP(void) {
  nhw_radio_stop_bit_counter();

  if ((radio_state == RAD_TX) || (radio_state == RAD_TXSTARTING)) {
    if (radio_state == RAD_TX) {
      abort_if_needed();
    }
    radio_state = RAD_TXIDLE;
    NRF_RADIO_regs.STATE = RAD_TXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
  } else if ( radio_state == RAD_RX ){
    abort_if_needed();
    radio_state = RAD_RXIDLE;
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
  } else if ( radio_state == RAD_CCA_ED ){
    //The documentation is not clear about what happens if we get a STOP during a CCA or ED procedure,
    //but it seems for CCA it can cause a bit of a mess depending on CCA mode.
    //the behavior here is that we stop just like if it was an active Rx, and do *not* trigger a CCASTOPPED or EDSTOPPED event
    bs_trace_warning_line_time(
        "NRF_RADIO: TASK_STOP received while the radio was performing a CCA or ED procedure. "
        "In this models we stop the procedure, but this can cause a mess in real HW\n");
    abort_if_needed();
    radio_state = RAD_RXIDLE;
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
  } else {
    bs_trace_warning_line_time(
        "NRF_RADIO: TASK_STOP received while the radio was not on either TX or RX but in state %i. "
        "It will be ignored\n",
        radio_state);
  }
}

void nhw_RADIO_TASK_DISABLE(void) {
  nhw_radio_stop_bit_counter();

  if ((radio_state == RAD_TX) || (radio_state == RAD_TXSTARTING)) {
    if (radio_state == RAD_TX) {
      abort_if_needed();
    }
    radio_state = RAD_TXIDLE; //Momentary (will be changed in the if below)
    NRF_RADIO_regs.STATE = RAD_TXIDLE;
  } else if ( radio_state == RAD_RX ){
    abort_if_needed();
    radio_state = RAD_RXIDLE; //Momentary (will be changed in the if below)
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
  } else if ( radio_state == RAD_CCA_ED ){
    //The documentation is not clear about what happens if we get a disable during a CCA  or ED procedure,
    //the assumption here is that we stop just like if it was an active Rx, but do not trigger a CCASTOPPED or EDSTOPPED event
    abort_if_needed();
    radio_state = RAD_RXIDLE; //Momentary (will be changed in the if below)
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
  }

  if (TIFS_state != TIFS_DISABLE) {
    TIFS_state = TIFS_DISABLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    Timer_TIFS = TIME_NEVER;
  }

  if ( ( radio_state == RAD_TXRU ) || ( radio_state == RAD_TXIDLE ) ) {
    radio_state = RAD_TXDISABLE;
    NRF_RADIO_regs.STATE = RAD_TXDISABLE;
    TIFS_state = TIFS_DISABLE;
    nhwra_set_Timer_RADIO(nsi_hws_get_time() + nhwra_timings_get_TX_rampdown_time());
  } else if ( ( radio_state == RAD_RXRU ) || ( radio_state == RAD_RXIDLE ) ) {
    radio_state = RAD_RXDISABLE;
    NRF_RADIO_regs.STATE = RAD_RXDISABLE;
    TIFS_state = TIFS_DISABLE;
    nhwra_set_Timer_RADIO(nsi_hws_get_time() + nhwra_timings_get_RX_rampdown_time());
  } else if ( radio_state == RAD_DISABLED ) {
    //It seems the radio will also signal a DISABLED event even if it was already disabled
    nhw_radio_stop_bit_counter();
    nhw_RADIO_signal_EVENTS_DISABLED(0);
  }
}

void nhw_RADIO_TASK_RSSISTART(void) {
  if ((radio_state != RAD_RX) && (radio_state != RAD_RXIDLE)) {
    bs_trace_warning_time_line("TASK_RSSISTART received while the radio was not in Rx. "
                               "The spec does not allow this. We just use the last Rx value in the model\n");
  }

  // When we receive this, wrt. the Phy communication either:
  // a) we have not started anything (radio_state != RAD_RX) (phy time is in the past in the previous transaction end)
  // b) Phy is waiting during an abort reevaluation before address match
  // c) we have got the addr and the phy is waiting for a response  to it (normal case, where the stack triggers RSSISTART via ADDRESS short)
  // d) the phy is waiting for us, in the middle or an abort reevaluation after addr.
  //   d.1) because stack triggered RSSISTART in SW after ADDRESS (time == phy time == address end time)
  //   d.2) because stack triggered RSSISTART in SW anywhere later in packet reception (time == phy time)
  // e) or we have finished a Phy Rx all together but the RADIO is still in Rx (we already got the CRC end from the Phy but we are still processing the packet in the RADIO, due to Rx prop. delay)
  //
  // Best approach:
  // if a)
  //      if real RADIO reports an old measured value then best is to use our latest
  //      otherwise to do a plain RSSI measurement now
  //        Note: It seems it is possible to do a RSSI measurement after ramp-up with the RADIO in RXIDLE. So we'd want to do a normal RSSI measurement in this case. But then we'd need to distinguish it from c) and e)
  // if b) => do an immediate RSSI measurement during abort reeval (this case we don't yet handle well now)
  // if c) best is to use the RSSI measurement from the addr => last Rx measurement
  // if d.1) => same as c)
  // if d.2) best to do is an immediate RSSI measurement during abort, but last rx measurement is going to be almost the same
  //   For d.1) an immediate RSSI measurement would produce the same result (just a bit of Phy comm overhead)
  // if e) => use last Rx measurement

  p2G4_rssi_power_t RSSI_value;
#if 0 //Note6.b
  if (abort_fsm_state == Rx_Abort_reeval) {
    //Respond with an immediate RSSI request during abort, get that response and let nhw_radio_timer_abort_reeval_triggered() handle it further
    RSSI_value = Rx_abort_imm_RSSI();
  } else
#endif
  {
    RSSI_value = rx_status.rx_resp.rssi.RSSI;
  }

  /* See Note6 */
  NRF_RADIO_regs.RSSISAMPLE = nhwra_RSSI_value_to_modem_format(
                                p2G4_RSSI_value_to_dBm(RSSI_value)
                                + cheat_rx_power_offset
                              );
#if !NHW_RADIO_IS_54
  nhw_RADIO_signal_EVENTS_RSSIEND(0);
#endif
}

