BabbleSim/ext_NRF52_hw_models/src/HW_models/NHW_RADIO.c
void nhw_RADIO_TASK_RSSISTOP(void) {
  /* Nothing to be done */
}

#if !NHW_RADIO_IS_54
void nhw_RADIO_regw_sideeffects_POWER(void) {
  if ( NRF_RADIO_regs.POWER == 0 ){
    radio_POWER = false;
  } else {
    if ( radio_POWER == false ){
      radio_POWER = true;
      abort_if_needed();
      radio_reset();
      nsi_hws_find_next_event();
    }
  }
}
#endif

/**
 * This is a fake task meant to start a HW timer for the TX->RX or RX->TX TIFS
 */
void nhw_RADIO_fake_task_TRXEN_TIFS(void) {
  if ( TIFS_state == TIFS_WAITING_FOR_DISABLE ) {
    TIFS_state = TIFS_TRIGGERING_TRX_EN;
    nhwra_set_Timer_RADIO(Timer_TIFS);
    if ( Timer_RADIO < nsi_hws_get_time() ){
      bs_trace_warning_line_time("NRF_RADIO: TIFS Ups: The Ramp down from Rx/Tx into a Tx/Rx takes more than the programmed TIFS time\n");
    }
  }
}

/**
 * If the HW automatic TIFS switch is enabled, prepare the internals for an automatic switch
 * (when a fake_task_TRXEN_TIFS is automatically triggered after a disable due to a shortcut)
 * otherwise do nothing
 *
 * Input Tx_Not_Rx: Are we finishing a Tx (true) or an Rx (false)
 */
void maybe_prepare_TIFS(bool Tx_Not_Rx){
  bs_time_t delta;
  if ( !nhwra_is_HW_TIFS_enabled() ) {
    TIFS_state = TIFS_DISABLE;
    return;
  }
  if ( NRF_RADIO_regs.SHORTS & RADIO_SHORTS_DISABLED_TXEN_Msk ){
    TIFS_ToTxNotRx = true;
  } else {
    TIFS_ToTxNotRx = false;
  }

  if ( Tx_Not_Rx ){ //End of Tx
    delta = NRF_RADIO_regs.TIFS + nhwra_timings_get_TX_chain_delay() - nhwra_timings_get_rampup_time(0, 1) - 3; /*open slightly earlier to have jitter margin*/
  } else { //End of Rx
    delta = NRF_RADIO_regs.TIFS - nhwra_timings_get_Rx_chain_delay() - nhwra_timings_get_TX_chain_delay() - nhwra_timings_get_rampup_time(1, 1) + 1;
  }
  Timer_TIFS = nsi_hws_get_time() + delta;
  TIFS_state = TIFS_WAITING_FOR_DISABLE; /* In Timer_TIFS we will trigger a TxEN or RxEN */
}

static void maybe_signal_event_RATEBOOST(void) {
  if (rx_status.CI == 1) {
    nhw_RADIO_signal_EVENTS_RATEBOOST(0);
  }
}

/**
 * The main radio timer (Timer_RADIO) has just triggered,
 * continue whatever activity we are on
 * (typically do something at the end/start of a state, set the new state
 * and schedule further the next state change)
 */
static void nhw_radio_timer_triggered(void) {
  if ( radio_state == RAD_TXRU ){
    radio_state = RAD_TXIDLE;
    NRF_RADIO_regs.STATE = RAD_TXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    nhw_RADIO_signal_EVENTS_READY(0);
    nhw_RADIO_signal_EVENTS_TXREADY(0);
  } else if ( radio_state == RAD_RXRU ){
    radio_state = RAD_RXIDLE;
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    nhw_RADIO_signal_EVENTS_READY(0);
    nhw_RADIO_signal_EVENTS_RXREADY(0);
  } else if ( radio_state == RAD_TXSTARTING ){
    nhwra_set_Timer_RADIO(TIME_NEVER);
    start_Tx();
  } else if ( radio_state == RAD_TX ){
    if ( radio_sub_state == TX_WAIT_FOR_ADDRESS_END ){
      if (tx_status.codedphy) {
        radio_sub_state = TX_WAIT_FOR_FEC1_END;
        nhwra_set_Timer_RADIO(tx_status.FEC2_start_time);
      } else {
        radio_sub_state = TX_WAIT_FOR_PAYLOAD_END;
        nhwra_set_Timer_RADIO(tx_status.PAYLOAD_end_time);
      }
      nhw_RADIO_signal_EVENTS_ADDRESS(0);
      nhw_RADIO_signal_EVENTS_FRAMESTART(0); //See note on FRAMESTART
    } else if ( radio_sub_state == TX_WAIT_FOR_FEC1_END ) {
      start_Tx_FEC2();
      radio_sub_state = TX_WAIT_FOR_PAYLOAD_END;
      nhwra_set_Timer_RADIO(tx_status.PAYLOAD_end_time);
    } else if ( radio_sub_state == TX_WAIT_FOR_PAYLOAD_END ) {
      radio_sub_state = TX_WAIT_FOR_CRC_END;
      nhwra_set_Timer_RADIO(tx_status.CRC_end_time);
      nhw_RADIO_signal_EVENTS_PAYLOAD(0);
    } else if ( radio_sub_state == TX_WAIT_FOR_CRC_END ) {
      radio_sub_state = SUB_STATE_INVALID;
      radio_state = RAD_TXIDLE;
      NRF_RADIO_regs.STATE = RAD_TXIDLE;
      nhwra_set_Timer_RADIO(TIME_NEVER);
      nhw_radio_stop_bit_counter();
      nhw_RADIO_signal_EVENTS_END(0);
      nhw_RADIO_signal_EVENTS_PHYEND(0); //See note on EVENTS_PHYEND
      maybe_prepare_TIFS(true);
    }  else { //SUB_STATE_INVALID
      bs_trace_error_time_line("programming error\n");
    }
  } else if ( radio_state == RAD_RX ){
    if ( radio_sub_state == RX_WAIT_FOR_ADDRESS_END ) {
      nhw_RADIO_signal_EVENTS_SYNC(0); //See note on EVENTS_SYNC
      nhw_RADIO_signal_EVENTS_ADDRESS(0);
      nhw_RADIO_signal_EVENTS_FRAMESTART(0); //See note on FRAMESTART
      nhwra_set_Timer_RADIO(TIME_NEVER); //Provisionally clear the RADIO timer for the Rx cont.
      Rx_Addr_received();
      if (rx_status.codedphy) {
        radio_sub_state = RX_WAIT_FOR_FEC1_END;
        // The timer will be set once we get the Phy FEC1 end response
      } else {
        radio_sub_state = RX_WAIT_FOR_PAYLOAD_END;
        nhwra_set_Timer_RADIO(rx_status.PAYLOAD_End_Time);
      }
    } else if ( radio_sub_state == RX_WAIT_FOR_FEC1_END ) {
      maybe_signal_event_RATEBOOST();
      /* The next state transition will be programmed when we get the Phy response for the FEC2 */
      nhwra_set_Timer_RADIO(TIME_NEVER);
      start_Rx_FEC2();
    } else if ( radio_sub_state == RX_WAIT_FOR_PAYLOAD_END ) {
      radio_sub_state = RX_WAIT_FOR_CRC_END;
      nhwra_set_Timer_RADIO(rx_status.CRC_End_Time);
      nhw_RADIO_signal_EVENTS_PAYLOAD(0);
    } else if ( radio_sub_state == RX_WAIT_FOR_CRC_END ) {
#if !NHW_RADIO_IS_54
      //TODO Reconnect as soon as the CCM model is in
      nhw_ccm_radio_received_packet(!rx_status.CRC_OK);
#endif
      radio_sub_state = SUB_STATE_INVALID;
      radio_state = RAD_RXIDLE;
      NRF_RADIO_regs.STATE = RAD_RXIDLE;
      nhwra_set_Timer_RADIO(TIME_NEVER);
      if ( rx_status.CRC_OK ) {
        nhw_RADIO_signal_EVENTS_CRCOK(0);
      } else {
        nhw_RADIO_signal_EVENTS_CRCERROR(0);
      }
      nhw_radio_stop_bit_counter();
      nhw_RADIO_signal_EVENTS_PHYEND(0); //See note on EVENTS_PHYEND
      nhw_RADIO_signal_EVENTS_END(0);
      maybe_prepare_TIFS(false);
    } else { //SUB_STATE_INVALID
      bs_trace_error_time_line("programming error\n");
    }
  } else if ( radio_state == RAD_CCA_ED ){
    radio_state = RAD_RXIDLE;
    NRF_RADIO_regs.STATE = RAD_RXIDLE;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    if (cca_status.CCA_notED) { //CCA procedure ended
      if (cca_status.is_busy) {
        nhw_RADIO_signal_EVENTS_CCABUSY(0);
      } else {
        nhw_RADIO_signal_EVENTS_CCAIDLE(0);
      }
    } else { //ED procedure ended
      nhw_RADIO_signal_EVENTS_EDEND(0);
    }
  } else if ( radio_state == RAD_TXDISABLE ){
    radio_state = RAD_DISABLED;
    NRF_RADIO_regs.STATE = RAD_DISABLED;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    nhw_radio_stop_bit_counter();
    nhw_RADIO_signal_EVENTS_DISABLED(0);
  } else if ( radio_state == RAD_RXDISABLE ){
    radio_state = RAD_DISABLED;
    NRF_RADIO_regs.STATE = RAD_DISABLED;
    nhwra_set_Timer_RADIO(TIME_NEVER);
    nhw_radio_stop_bit_counter();
    nhw_RADIO_signal_EVENTS_DISABLED(0);
  } else {
    if ( ( radio_state == RAD_DISABLED ) && ( TIFS_state == TIFS_TRIGGERING_TRX_EN ) ) {
      if ( Timer_RADIO != Timer_TIFS ){
        bs_trace_warning_line_time("NRF_RADIO: TIFS Ups 3\n");
      }
      TIFS_state = TIFS_DISABLE;
      nhwra_set_Timer_RADIO(TIME_NEVER);
      from_hw_tifs = true;
      if ( TIFS_ToTxNotRx ) {
        nhw_RADIO_TASK_TXEN();
      } else {
        nhw_RADIO_TASK_RXEN();
      }
      from_hw_tifs = false;
    } else {
      bs_trace_error_line_time(
          "NRF_RADIO: this should not have happened (radio_state =%i)\n",
          radio_state);
    }
  }
}

NSI_HW_EVENT(Timer_RADIO, nhw_radio_timer_triggered, 990 /*We want the radio to be one of the very last to avoid unnecessary abort re-evaluations to the Phy*/);

/**
 * The abort reevaluation timer has just triggered,
 * => we can now respond to the Phy with our abort decision
 */
static void nhw_radio_timer_abort_reeval_triggered(void) {
  nhwra_set_Timer_abort_reeval(TIME_NEVER);

