BabbleSim/ext_NRF52_hw_models/src/HW_models/NHW_RADIO.c
  int ret;
  if (tx_status.codedphy) {
    //Request the FEC1 Tx from the Phy:
    ret = p2G4_dev_req_txv2_nc_b(&tx_status.tx_req_fec1, &CI, &tx_status.tx_resp);
  } else { /* not codedphy */
    //Request the Tx from the Phy:
    ret = p2G4_dev_req_txv2_nc_b(&tx_status.tx_req, tx_buf, &tx_status.tx_resp);
  }
  handle_Tx_response(ret);

  radio_sub_state = TX_WAIT_FOR_ADDRESS_END;
  nhwra_set_Timer_RADIO(tx_status.ADDRESS_end_time);
}

static void start_Tx_FEC2(void) {
  int ret;
  update_abort_struct(&tx_status.tx_req.abort, &next_recheck_time);
  tx_status.tx_req.phy_address = 0; /* An invalid address */
  ret = p2G4_dev_req_txv2_nc_b(&tx_status.tx_req, tx_buf, &tx_status.tx_resp);
  handle_Tx_response(ret);
}

static void Rx_handle_CI_reception(void) {
  rx_status.CI = rx_buf[0] & 0x3;

  if ((rx_status.rx_resp.packet_size < 1) || (rx_status.CI > 1)) {
    bs_trace_warning_time_line("%s: Received supposed BLE CodedPhy FEC1 without CI or corrupted CI (%i, %i)\n",
        __func__, rx_status.rx_resp.packet_size, rx_status.CI);
  }

  NRF_RADIO_regs.PDUSTAT |= (rx_status.CI << RADIO_PDUSTAT_CISTAT_Pos) & RADIO_PDUSTAT_CISTAT_Msk;

  if (rx_status.rx_resp.status != P2G4_RXSTATUS_OK) {
    /* Error during CI decoding, we don't know how many bits, and if it would have recovered.
     * So, we just do a 50% drop of having each CI bit corrupted or not */
    int error;
    error = bs_random_Bern(RAND_PROB_1/2);
    NRF_RADIO_regs.PDUSTAT ^= error << (RADIO_PDUSTAT_CISTAT_Pos + 1); /* The don't-care bit in CI */

    error = bs_random_Bern(RAND_PROB_1/2);
    if (error) {
      NRF_RADIO_regs.PDUSTAT ^= 1 << (RADIO_PDUSTAT_CISTAT_Pos);
      rx_status.CI ^= 1;
      rx_status.CI_error = true;
    }
  }
}

static void Rx_handle_end_response(bs_time_t end_time) {

  if (rx_status.inFEC1 == true) { /* End of CodedPhy packet FEC1 */
    Rx_handle_CI_reception();

  } else { //Normal packet or end of FEC2
    if (rx_status.rx_resp.status != P2G4_RXSTATUS_HEADER_ERROR) {
        rx_status.CRC_End_Time = end_time + nhwra_timings_get_Rx_chain_delay();
    } //Otherwise we do not really now how the Nordic RADIO behaves depending on
    //where the biterrors are and so forth. So let's always behave like if the
    //packet lenght was received correctly, and just report a CRC error at the
    //end of the CRC

    if ( rx_status.rx_resp.status == P2G4_RXSTATUS_OK ){
      NRF_RADIO_regs.RXCRC = nhwra_get_rx_crc_value(rx_buf, rx_status.rx_resp.packet_size);
      rx_status.CRC_OK = 1;
      NRF_RADIO_regs.CRCSTATUS = 1;
    }
  }
}


static void Rx_handle_address_end_response(bs_time_t address_time) {

  rx_status.ADDRESS_End_Time = address_time + nhwra_timings_get_Rx_chain_delay();

  if ((rx_status.codedphy == true) && (rx_status.inFEC1)) {
    rx_status.FEC2_start_time = address_time + 16 + 24 + 1; /* It will be updated on the FEC1 Rx end */
    rx_status.packet_rejected = false; //We always accept the FEC1 part

    //Let's set a very provisional packet end time, in case the Tx aborts between FEC1 and FEC2:
    rx_status.PAYLOAD_End_Time = rx_status.FEC2_start_time + 2*8/bits_per_us
                                + nhwra_timings_get_Rx_chain_delay(); /* An empty packet */
    rx_status.CRC_End_Time = rx_status.PAYLOAD_End_Time + rx_status.CRC_duration;
    return;
  }
  //Otherwise, FEC2 or not Coded Phy

  uint length = nhwra_get_payload_length(rx_buf);
  uint max_length = nhwra_get_MAXLEN();

  if (length > max_length) {
    // We reject the packet right away, setting the CRC error, and timers as expected
    bs_trace_warning_time_line("NRF_RADIO: received a packet longer than the configured MAXLEN (%i>%i). Truncating it\n", length, max_length);
    length  = max_length;
    NRF_RADIO_regs.PDUSTAT |= RADIO_PDUSTAT_PDUSTAT_Msk;
    rx_status.packet_rejected = true;
  } else {
    rx_status.packet_rejected = false;
  }
  if (rx_status.CI_error) {
    /* Let's just stop the Phy reception here, as continuing does not give us anything anymore */
    rx_status.packet_rejected = true;
  }

  //TODO: Discard Ieee802154_250Kbit frames with length == 0

  bs_time_t payload_end = 0;

  if (nhwra_is_ble_mode(NRF_RADIO_regs.MODE)) {
    payload_end = rx_status.rx_resp.rx_time_stamp + (bs_time_t)((2+length)*8/bits_per_us);
  } else if (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ieee802154_250Kbit) {
    payload_end = rx_status.rx_resp.rx_time_stamp + (bs_time_t)((1+length)*8/bits_per_us);
  } //Eventually this should be generalized with the packet configuration

  rx_status.PAYLOAD_End_Time = nhwra_timings_get_Rx_chain_delay() +
                               hwll_dev_time_from_phy(payload_end);

  int TERM2_duration = 0; /* See Note21.b */
  if (rx_status.codedphy) {
    if (rx_status.CI == 1) {
      TERM2_duration = 6; //S=2 * 3bits
    } else {
      TERM2_duration = 24;//S=8 * 3bits
    }
  }

  rx_status.CRC_End_Time = rx_status.PAYLOAD_End_Time + rx_status.CRC_duration + TERM2_duration; //Provisional value (if we are accepting the packet)

  //Copy the whole packet (S0, lenght, S1 & payload) excluding the CRC.
  if (nhwra_is_ble_mode(NRF_RADIO_regs.MODE)) {
    if (rx_status.rx_resp.packet_size >= 5) { /*At least the header and CRC, otherwise better to not try to copy it*/
      ((uint8_t*)NRF_RADIO_regs.PACKETPTR)[0] = rx_buf[0];
      ((uint8_t*)NRF_RADIO_regs.PACKETPTR)[1] = rx_buf[1];
      /* We cheat a bit and copy the whole packet already (The AAR block will look in Adv packets after 64 bits)*/
      memcpy(&((uint8_t*)NRF_RADIO_regs.PACKETPTR)[2 + rx_status.S1Offset],
          &rx_buf[2] , length);
    }
  } else if (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ieee802154_250Kbit) {
    if (rx_status.rx_resp.packet_size >= 3) { /*At least the header and CRC, otherwise better to not try to copy it*/
            ((uint8_t*)NRF_RADIO_regs.PACKETPTR)[0] = rx_buf[0];
            memcpy(&((uint8_t*)NRF_RADIO_regs.PACKETPTR)[1 + rx_status.S1Offset],
                &rx_buf[1] , length);
          }
  } //Eventually this should be generalized with the packet configuration

  if (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ieee802154_250Kbit) {
    //The real HW only copies the LQI value after the payload in this mode
    //Note that doing it this early is a cheat
    double RSSI = p2G4_RSSI_value_to_dBm(rx_status.rx_resp.rssi.RSSI) + cheat_rx_power_offset;
    uint8_t LQI = nhwra_dBm_to_modem_LQIformat(RSSI);
    //Eventually this should be generalized with the packet configuration:
    ((uint8_t*)NRF_RADIO_regs.PACKETPTR)[1 + rx_status.S1Offset + length] = LQI;
  }

