BabbleSim/ext_NRF52_hw_models/src/HW_models/NHW_RADIO.c
}

/**
 * Handle all possible responses from the phy to a Rx request
 */
static void handle_Rx_response(int ret){
  if (ret == -1) {
    bs_trace_raw_manual_time(3,nsi_hws_get_time(),"Communication with the phy closed during Rx\n");
    hwll_disconnect_phy_and_exit();

  } else if (ret == P2G4_MSG_ABORTREEVAL) {

    phy_sync_ctrl_set_last_phy_sync_time( next_recheck_time );
    abort_fsm_state = Rx_Abort_reeval;
    nhwra_set_Timer_abort_reeval( BS_MAX(next_recheck_time,nsi_hws_get_time()) );

  } else  if ((ret == P2G4_MSG_RXV2_ADDRESSFOUND) && (radio_state == RAD_RX /*if we havent aborted*/)) {

    bs_time_t addres_time = hwll_dev_time_from_phy(rx_status.rx_resp.rx_time_stamp); //this is the end of the sync word in air time
    phy_sync_ctrl_set_last_phy_sync_time(addres_time);
    Rx_handle_address_end_response(addres_time);

    if ((rx_status.codedphy == false) || (rx_status.inFEC1)) {
      radio_sub_state = RX_WAIT_FOR_ADDRESS_END;
      nhwra_set_Timer_RADIO(rx_status.ADDRESS_End_Time);
    } else { //FEC2
      radio_sub_state = RX_WAIT_FOR_PAYLOAD_END;
      nhwra_set_Timer_RADIO(TIME_NEVER);
      Rx_Addr_received();
      nhwra_set_Timer_RADIO(rx_status.PAYLOAD_End_Time);
    }
  } else if ((ret == P2G4_MSG_RXV2_END) && (radio_state == RAD_RX /*if we havent aborted*/)) {

    bs_time_t end_time = hwll_dev_time_from_phy(rx_status.rx_resp.end_time);
    phy_sync_ctrl_set_last_phy_sync_time(end_time);

    /* P2G4_RXSTATUS_NOSYNC during a simple packet or CodedPhy FEC1 cannot really happen
     * As that would mean we have run out of the "infinite" scan time.
     * It can happen though at the start of the CodedPhy FEC2, if the transmitter aborted
     * before starting the FEC2 */
    if (rx_status.rx_resp.status == P2G4_RXSTATUS_NOSYNC) {
      if ((rx_status.codedphy == false) || (rx_status.inFEC1 == true)) {
        bs_trace_error_time_line("Unexpected not-handled path\n");
      }
      /* Otherwise we just wait for the RX_WAIT_FOR_PAYLOAD_END handling in the main RADIO FSM
       * A provisional PAYLOAD_End_Time was set earlier */
      radio_sub_state = RX_WAIT_FOR_PAYLOAD_END;
      nhwra_set_Timer_RADIO(rx_status.PAYLOAD_End_Time);
      return;
    } else {
      Rx_handle_end_response(end_time);

      if (rx_status.inFEC1 == true) {
        /* To avoid issues with possible rounding errors in the phy<->dev timing conversion,
         * we ensure the FEC2 Rx will start in the next us in Phy time */
        rx_status.rx_req.start_time = rx_status.rx_resp.end_time + 1;
        nhwra_set_Timer_RADIO(rx_status.FEC2_start_time);
      }
    }
  }
}

#if 0 //Note6.b
/*
 * Request an immediate RSSI measurement during an Rx abort reevaluation
 * with the same Rx parameters as the currently ongoing reception
 * (the abort reevaluation will be left pending)
 */
static p2G4_rssi_power_t Rx_abort_imm_RSSI(void) {
  p2G4_rssi_t rssi_req;
  p2G4_rssi_done_t rssi_resp;
  p2G4_rxv2_t *rx_req = &rx_status.rx_req;

  //Right now, though as an immediate request this is actually ignored by the Phy:
  rssi_req.meas_time = hwll_phy_time_from_dev(nsi_hws_get_time());
  rssi_req.antenna_gain = rx_req->antenna_gain;
  memcpy(&rssi_req.radio_params, &rx_req->radio_params, sizeof(p2G4_radioparams_t));

  int ret = p2G4_dev_req_imm_RSSI_nc_b(&rssi_req, &rssi_resp);

  if (ret == -1) {
    bs_trace_raw_manual_time(3,nsi_hws_get_time(),"Communication with the phy closed during Rx abort reeval\n");
    hwll_disconnect_phy_and_exit();
  }

  return rssi_resp.RSSI;
}
#endif

/**
 * We have reached the time in which we wanted to reevaluate if we would abort or not
 * so we answer to the phy with our decision
 */
static void Rx_abort_eval_respond(void) {
  //The abort must have been evaluated by now so we can respond to the waiting phy
  p2G4_abort_t *abort = &rx_status.rx_req.abort;
  update_abort_struct(abort, &next_recheck_time);

  int ret = p2G4_dev_provide_new_rxv2_abort_nc_b(abort);

  handle_Rx_response(ret);
}

/*
 * Actually start the Rx in this microsecond
 */
static void start_Rx(void) {
  #define RX_N_ADDR 8 /* How many addresses we can search in parallel */
  p2G4_address_t rx_addresses[RX_N_ADDR];

  nhwra_check_packet_conf();

  radio_state = RAD_RX;
  NRF_RADIO_regs.STATE = RAD_RX;
  NRF_RADIO_regs.CRCSTATUS = 0;
  NRF_RADIO_regs.PDUSTAT = 0;

  if ( NRF_RADIO_regs.PCNF0 & ( RADIO_PCNF0_S1INCL_Include << RADIO_PCNF0_S1INCL_Pos ) ){
    rx_status.S1Offset = 1; /*1 byte offset in RAM (S1 length > 8 not supported)*/
  } else {
    rx_status.S1Offset = 0;
  }

  rx_status.codedphy = false;
  rx_status.inFEC1 = false;
  rx_status.CI_error = false;
  rx_status.CI = 0;

  if (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ble_1Mbit) {
    bits_per_us = 1;
  } else if (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ble_2Mbit) {
    bits_per_us = 2;
  } else if ((NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ble_LR125Kbit)
      || (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ble_LR500Kbit)) {
    bits_per_us = 0.125; /* For FEC1 part */
    rx_status.codedphy = true;
    rx_status.inFEC1 = true;
  } else if (NRF_RADIO_regs.MODE == RADIO_MODE_MODE_Ieee802154_250Kbit) {
    bits_per_us = 0.25;
  }
  rx_status.CRC_duration = nhwra_get_crc_length()*8/bits_per_us;
  rx_status.CRC_OK = false;
  rx_status.rx_resp.status = P2G4_RXSTATUS_NOSYNC;

  if (rx_status.codedphy) {
    nhwra_prep_rx_request_FEC1(&rx_status.rx_req_fec1, rx_addresses);
    update_abort_struct(&rx_status.rx_req_fec1.abort, &next_recheck_time);
  }
  nhwra_prep_rx_request(&rx_status.rx_req, rx_addresses);
  update_abort_struct(&rx_status.rx_req.abort, &next_recheck_time);

  //attempt to receive
  int ret;
  if (rx_status.codedphy) {
    ret = p2G4_dev_req_rxv2_nc_b(&rx_status.rx_req_fec1, rx_addresses,
                                 &rx_status.rx_resp, &rx_pkt_buffer_ptr,
                                 _NRF_MAX_PACKET_SIZE);
  } else {
    ret = p2G4_dev_req_rxv2_nc_b(&rx_status.rx_req, rx_addresses,
                                 &rx_status.rx_resp,&rx_pkt_buffer_ptr,
                                 _NRF_MAX_PACKET_SIZE);
  }

