BabbleSim/ext_NRF52_hw_models/src/HW_models/NHW_RADIO.c
  radio_sub_state = SUB_STATE_INVALID;
  nhwra_set_Timer_RADIO(TIME_NEVER);

  handle_Rx_response(ret);
}

/*
 * Start the Rx for a CodedPhy FEC2 packet part in this microsecond
 */
static void start_Rx_FEC2(void) {

  rx_status.inFEC1 = false;

  if (rx_status.CI == 0) {
    rx_status.rx_req.coding_rate = 8;
    //error_calc_rate & header_duration preset in nhwra_prep_rx_request() are already correct
  } else { //0b01
    bits_per_us = 0.5;
    rx_status.rx_req.coding_rate = 2;
    rx_status.rx_req.error_calc_rate = 500000;
    rx_status.rx_req.header_duration = 2*8*2 /* 2 bytes at 500kbps */;
  }
  /* rx_req.start_time was set based on the FEC1 end */
  rx_status.rx_req.pream_and_addr_duration = 0;
  rx_status.rx_req.n_addr = 0;
  rx_status.rx_req.scan_duration = 1;
  rx_status.rx_req.prelocked_tx = true;

  rx_status.CRC_duration = nhwra_get_crc_length()*8/bits_per_us;

  update_abort_struct(&rx_status.rx_req.abort, &next_recheck_time);

  int ret;

  ret = p2G4_dev_req_rxv2_nc_b(&rx_status.rx_req, NULL,
                               &rx_status.rx_resp, &rx_pkt_buffer_ptr,
                               _NRF_MAX_PACKET_SIZE);

  handle_Rx_response(ret);
}

/**
 * This function is called at the time when the Packet address* would have been
 * completely received for simple packets, AND at the beginning of the FEC2
 * for CodedPhy packets.
 * (* at the time of the end of the last bit of the packet address)
 * To continue processing the reception (the Phy was left waiting for a response)
 *
 * Note that libPhyCom has already copied the whole packet into the input buffer
 */
static void Rx_Addr_received(void) {

  bool accept_packet = !rx_status.packet_rejected;

  if (rx_status.codedphy == false || rx_status.inFEC1 == false) {
    NRF_RADIO_regs.RXMATCH = 0; //The only we support so far

    if (NRF_RADIO_regs.DACNF & 0xFF) { /*If any of the addresses for device address match is enabled*/
      /*
       * NOTE: we cheat and we already check the advertisement addresses and
       * raise the event, even though we should wait for 16 + 48 bits more
       *
       * If this is a problem, add a new timer and Rx state and delay raising the event
       * until then
       */
      nhw_radio_device_address_match(rx_buf);
    }
  }

  update_abort_struct(&rx_status.rx_req.abort, &next_recheck_time);
  int ret = p2G4_dev_rxv2_cont_after_addr_nc_b(accept_packet, &rx_status.rx_req.abort);

  if ( accept_packet ){ /* Always true for CodedPhy FEC1 */
    handle_Rx_response(ret);
  } else {
    //We said we don't want to continue => there will be no response (ret==0 always). We just close the reception like if the phy finished on its own even though we finished it

    //We do what would correspond to Rx_handle_end_response() as it won't get called
    NRF_RADIO_regs.RXCRC = nhwra_get_rx_crc_value(rx_buf, rx_status.rx_resp.packet_size);
#if !NHW_RADIO_IS_54
      //TODO Reconnect as soon as the CCM model is in
    nhw_ccm_radio_received_packet(!rx_status.CRC_OK);
#endif
  }
}

/**
 * Check if the address in the received (advertisement) packet
 * matches one configured in the DAP/DAB registers as set by DACNF
 *
 * If it does, it sets appropriately the DAI register,
 * in any case, it generates the DEVMATCH and DEVMISS signals accordingly
 *
 * Note that, as specified in the infocenter documentation,
 * the address is assumed to be the first 48 bits after the 2 byte header
 * and the TxAddr bit to be 7th bit in 1st header byte as per the BT Core spec.
 */
static void nhw_radio_device_address_match(uint8_t rx_buf[]) {
  bool match_found = false;
  bool nomatch;
  int TxAdd;

  for (int i = 0 ; i < 8; i++) {
    if (((NRF_RADIO_regs.DACNF >> i) & 1) == 0 ) {
      continue;
    }

    TxAdd = (NRF_RADIO_regs.DACNF >> (i + 8)) & 1;

    if (TxAdd != ((rx_buf[0] >> 6) & 1) ) {
      continue;
    }

    nomatch = (*(uint32_t *)(rx_buf + 2) != NRF_RADIO_regs.DAB[i]);
    uint32_t DAP = NRF_RADIO_regs.DAP[i] & UINT16_MAX;
    nomatch |= (*(uint16_t *)(rx_buf + 6) != DAP);

    if (nomatch) {
      continue;
    }

    match_found = true;
    NRF_RADIO_regs.DAI = i;
    break;
  }

  if (match_found) {
    nhw_RADIO_signal_EVENTS_DEVMATCH(0);
  } else {
    nhw_RADIO_signal_EVENTS_DEVMISS(0);
  }
}

static void CCA_handle_end_response(void) {
  //Depending on mode, set status and registers
  //raising CCAIDLE, CCABUSY or EDEND will happen in the correct time in the main machine

  if (cca_status.CCA_notED) { //End a CCA procedure
    uint CCAMode = (NRF_RADIO_regs.CCACTRL & RADIO_CCACTRL_CCAMODE_Msk) >> RADIO_CCACTRL_CCAMODE_Pos;

    if ((CCAMode == RADIO_CCACTRL_CCAMODE_EdMode)
        || (CCAMode == RADIO_CCACTRL_CCAMODE_EdModeTest1)) {
      cca_status.is_busy = cca_status.cca_resp.rssi_overthreshold;
    } else if (CCAMode == RADIO_CCACTRL_CCAMODE_CarrierMode) {
      cca_status.is_busy = cca_status.cca_resp.mod_found;
    } else if (CCAMode == RADIO_CCACTRL_CCAMODE_CarrierAndEdMode) {
      cca_status.is_busy = cca_status.cca_resp.mod_found
          && cca_status.cca_resp.rssi_overthreshold;
    } else if (CCAMode == RADIO_CCACTRL_CCAMODE_CarrierOrEdMode) {
      cca_status.is_busy = cca_status.cca_resp.mod_found
          || cca_status.cca_resp.rssi_overthreshold;
    } else {
      bs_trace_error_time_line("%s, CCAMODE=%i suppport not yet implemented\n",
          __func__, CCAMode);
    }
  } else { // Ending an ED procedure
    double RSSI = p2G4_RSSI_value_to_dBm(cca_status.cca_resp.RSSI_max) + cheat_rx_power_offset;
    NRF_RADIO_regs.EDSAMPLE = nhwra_dBm_to_modem_LQIformat(RSSI);
  }
}

/**
 * Handle all possible responses to a CCA request from the Phy
 */
static void handle_CCA_response(int ret){
  if (ret == -1){
    bs_trace_raw_manual_time(3,nsi_hws_get_time(),"The Phy disconnected us during a CCA procedure\n");
    hwll_disconnect_phy_and_exit();
  } else if ( ret == P2G4_MSG_CCA_END  ) {
    bs_time_t end_time = hwll_dev_time_from_phy(cca_status.cca_resp.end_time);
    phy_sync_ctrl_set_last_phy_sync_time( end_time );
    cca_status.CCA_end_time = end_time;
    if (radio_state == RAD_CCA_ED) { /*if we haven't aborted*/
      nhwra_set_Timer_RADIO(cca_status.CCA_end_time);
    }
    CCA_handle_end_response();
  } else if ( ret == P2G4_MSG_ABORTREEVAL ) {
    phy_sync_ctrl_set_last_phy_sync_time( next_recheck_time );
    abort_fsm_state = CCA_Abort_reeval;
    nhwra_set_Timer_abort_reeval(next_recheck_time);
  }
}

/**
 * We have reached the time in which we wanted to reevaluate if we would abort or not
 * so we answer to the Phy with our decision
 */
static void CCA_abort_eval_respond(void) {
  //The abort must have been evaluated by now so we can respond to the waiting phy
  p2G4_abort_t *abort = &cca_status.cca_req.abort;

  update_abort_struct(abort, &next_recheck_time);

  int ret = p2G4_dev_provide_new_cca_abort_nc_b(abort);

  handle_CCA_response(ret);
}

/**
 * Start CCA or ED procedure right now.
 * input: CCA_not_ED = 1 for CCA, 0 for ED
 */
static void start_CCA_ED(bool CCA_not_ED){

  radio_state = RAD_CCA_ED;

  cca_status.CCA_notED = CCA_not_ED;
  cca_status.is_busy = false;

  nhwra_prep_cca_request(&cca_status.cca_req, CCA_not_ED, cheat_rx_power_offset);

  update_abort_struct(&cca_status.cca_req.abort, &next_recheck_time);

  //Expected end time; note that it may be shorter if detect over threshold is set
  cca_status.CCA_end_time = nsi_hws_get_time() + cca_status.cca_req.scan_duration;
  nhwra_set_Timer_RADIO(cca_status.CCA_end_time);

  //Request the CCA from the Phy:
  int ret = p2G4_dev_req_cca_nc_b(&cca_status.cca_req, &cca_status.cca_resp);
  handle_CCA_response(ret);
}

void hw_radio_testcheat_set_rx_power_gain(double power_offset){
  cheat_rx_power_offset = power_offset;
}
